{
    "piotr.orlowski": {
        "name": "Piotr Orłowski",
        "bio": "Software Development Manager with over twenty years of experience in IT and e-commerce. At Allegro he manages the work of 150+ engineers taking care of their continuous substantive development, he is responsible for the technical quality, stability and efficiency of the Allegro platform. He likes simple solutions which gives more possibilities than originally planned :)",
        "twitter": "nigraspl"
    },
    "adam.dubiel": {
        "name": "Adam Dubiel",
        "bio": "Adam is the library guy, who loves designing reusable software components with minimal dependencies, maximal usefulness and user friendly API. At Allegro he leads team responsible for creating internal services-for-services and tools that make development of microservices easier, the most significant one being [Hermes](http://hermes.allegro.tech/).",
        "twitter": "dubieladam",
        "github": "adamdubiel"
    },
    "piotr.stapp": {
        "name": "Piotr Stapp",
        "bio": "Doer. Microsoft MVP. Master of Science. Speaker and blogger. VP at devwarsztaty.pl. CxO of dotnetomaniak.pl. Don't Stapp me now, please!",
        "twitter": "ptrstpp950",
        "linkedin": "piotrstapp"
    },
    "pawel.zwierzchowski": {
        "name": "Paweł Zwierzchowski",
        "bio": "Software test engineer with a relevant full stack experience from various companies, who helps achieve better quality results by testing software and sharing knowledge. Testing has been his life since 2011. A real team member, involved not only in all the testing, but also in the final delivery of the product to end users. Besides testing, he loves all kinds of cars and PC games. A big fan of donuts.",
        "linkedin": "paweł-zwierzchowski"
    },
    "martyna.niszczota": {
        "name": "Martyna Niszczota",
        "bio": "Martyna works in Delivery Promise product. Her priorities are effective, client-oriented results; and maintaining positive relations within the developers team and promoting cooperation with other departments. Martyna has got an HR background and her view of the IT world is different from the standard one.",
        "linkedin": "martyna-niszczota"
    },
    "kasia.wrobel": {
        "name": "Kasia Wróbel",
        "bio": "UX designer who let her curiosity be the driving force of her life. Introverted, but willing to discuss dogs. A lifelong bookworm with a black sense of humour included.",
        "linkedin": "katarzyna-wrobel-ux"
    },
    "ireneusz.gawlik": {
        "name": "Ireneusz Gawlik",
        "bio": "Fascinated with Machine Learning and applying it to create products at scale. When he wanted to develop and learn while working in the best commercial ML research group in the country, he created one. In his spare time he plays the drums, traveling with bandmates to unusual places."
    },
    "eryk.napierala": {
        "name": "Eryk Napierała",
        "bio": "Guardian of web performance at Allegro. Front-end developer who is not afraid of data analysis. Meet.js Poznań co-organizer.",
        "github": "erykpiast"
    },
    "tomasz.nurkiewicz": {
        "name": "Tomasz Nurkiewicz",
        "bio": "Java Champion. Author, trainer, conference speaker, technical reviewer, runner. Wrote a book on RxJava for O’Reilly. Claims that code not tested automatically is not a feature but just a rumour.",
        "twitter": "tnurkiewicz",
        "github": "nurkiewicz"
    },
    "wojciech.lesicki": {
        "name": "Wojciech Lesicki",
        "bio": "Team Leader in the IT Security department. Once responsible for cloud solutions (OpenStack, AWS etc.) and containerization (Mesos / Marathon). Currently, he focuses on defending the entire Allegro platform, the security of the implementation process, pentests and projects related to the security of the entire company. He works with developers and business looking for what can be done to make it more secure. He loves all possibilities of improving products / solutions / technologies.  Recently, he also started promoting knowledge of IT security in native Poznań. In his free time he walks the mountains and explores the Att&ck MITER framework.",
        "twitter": "WLesicki",
        "linkedin": "wojciechlesicki"
    },
    "justyna.osten-sacken": {
        "name": "Justyna Osten-Sacken",
        "bio": "UX researcher part of a team taking care of end-to-end customer experience - starting from search and selection till purchase. Having her team by her side, she creates knowledge and recommendations based on customers opinions. It helps teams to introduce new products or changes to existing ones. She practices calligraphy, likes Italian small towns and micro trips around Poland. Cooking relaxes her very much. Hitchhiking enthusiast.",
        "linkedin": "justyna-osten-sacken"
    },
    "adam.dudczak": {
        "name": "Adam Dudczak",
        "bio": "Team manager in allegro.pl, on a daily basis I work on improving search experience in the biggest ecommerce site in Poland. I am professionally involved with Java and related technologies since 2004, currently focused on search and information retrieval. Organizer of GeeCON conference and former leader of Poznan Java User Group.",
        "twitter": "maneo"
    },
    "kamil.borzym": {
        "name": "Kamil Borzym",
        "bio": "Kamil is an iOS software developer. He is very curious of how things work internally, so he likes to decompile frameworks and apps.",
        "twitter": "kam800"
    },
    "piotr.betkier": {
        "name": "Piotr Betkier",
        "bio": "Software Engineer who loves building useful tools and resilient systems. Works in one of the technical platform teams, where he's responsible for common libraries and service discovery (Service Mesh). Conference speaker, host of Allegro Tech Podcast.",
        "twitter": "piotrbetkier"
    },

    "lukasz.sciga": {
        "name": "Łukasz Ściga",
        "bio": "Data Engineer w Allegro, którego pasją jest programowanie gier komputerowych.",
        "linkedin": "łukasz-ściga-274150138"
    },
    "dariusz.jedrzejczyk": {
        "name": "Dariusz Jędrzejczyk",
        "bio": "Principal Software Engineer at Allegro Technical Platform and former Leader of the team responsible for introducing Service Mesh.",
        "twitter": "chemicL",
        "linkedin": "dariuszjedrzejczyk"
    },
    "piotr.klapczynski": {
        "name": "Piotr Klapczyński",
        "bio": "Piotr has been a Site Reliability Engineer for seven years. Currently, he supports stability as a SRE team leader responsible for the development of chaos engineering tools and performance tests.",
        "twitter": "klaper_",
        "linkedin": "piotr-klapczyński-6540a63"
    },
    "alicja.halamska": {
        "name": "Alicja Halamska",
        "bio": "Ukończyła Politechnikę Poznańską z tytułem inżyniera, jest miłośniczką trudnych problemów, których rozwiązanie sprawia jej najwięcej satysfakcji. Uwielbia poznawać nowe technologie i analizować ich różnice oraz podobieństwa. Do wszystkiego podchodzi z dystansem, a prywatnie uwielbia chodzić po górach.",
        "linkedin": "alicja-halamska-965875166"
    },
    "jakub.kaczmarski": {
        "name": "Jakub Kaczmarski",
        "bio": "Technology Director at Allegro.pl, responsible for the product and technology areas at Allegro Smart! and Delivery Experience in Allegro, including the ERP system (Microsoft DAX) of the Official Allegro Store. In Allegro.pl since 2013 - he manages a team of approximately 200 engineers, product managers and analysts. Former Java developer and certified Oracle database administrator. Previously, the Head of the Software Development Department at Gazeta.pl (Agora). Privately basketball fan.",
        "linkedin": "jakub-kaczmarski"
    },
    "aleksandra.wasielewska": {
        "name": "Aleksandra Wasielewska",
        "bio": "Product Manager with over 10 years of experience in ebanking, online payments and ecommerce areas. Ola is passionate about technology and people. In Allegro she takes care of consumer-centric solutions in payments area where she improves and provides new financial services and addresses needs of million of Allegro customers. Every day she is surrounded by stakeholders and tech teams where she is in her element. Specifically attuned to the challenges of women in tech and the voice of those who change theirs carrier direction. An agile enthusiast in every way, enjoys spending time traveling around the world, reflecting cultural contrasts in the day-by-day life, as well as in the products.",
        "linkedin": "aleksandra-wasielewska-0036b852"
    },
    "julia.bluszcz": {
        "name": "Julia Bluszcz",
        "bio": "Julia holds degrees in statistics and quantitative methods in economics from the Humboldt University in Berlin and Warsaw School of Economics. She has gathered work experience in tech start-ups Nethone and Omni:us where she worked on fraud detection in credit card transactions and organized tech-related events, e.g. Machine Intelligence Summit in Berlin. Her scientific interests include machine learning, data visualization, and econometrics. Julia works as a Senior Data Scientist at Allegro, where she specializes in forecasting and analysing consumer buying behavior.",
        "linkedin": "julia-bluszcz-432103136"
    },
    "michal.bareja": {
        "name": "Michał Bareja",
        "bio": "Michał is a Development Team Leader in the Delivery Experience area. Huge fan of Domain-Driven Design, Test-Driven Development, Pair Programming, Event Storming and Agile methodologies. Worked in software houses through most of his career. After joining Allegro, he discovered that product development means a lot more than just writing code.",
        "linkedin": "michaelbareja",
        "twitter": "MichaelBareja"
    },
    "bartosz.galek": {
        "name": "Bartosz Gałek",
        "bio": "Just as Obelix did not need a magic drink to be strong - Bartosz does not need coffee to always be full of energy and shares it with his team. Huge fan of board games, supporter and co-creator of open source software. Operates in Warsaw! Bartosz cannot resist Hackathon attendance.",
        "github": "bgalek"
    },
    "dariusz.eliasz": {
        "name": "Dariusz Eliasz",
        "bio": "His main interests include Big Data solutions architecture and data governance. He is enthusiastic about scalable distributed solutions, processing large datasets and constant search for improvements. He combines all those interests with planning and managing projects that implement said solutions."
    },
    "piotr.michonski": {
      "name": "Piotr Michoński",
      "bio": "Piotr’s main interests include creating a technological platform and combining human and technological development  –  the one that drives Allegro’s growth and lies at the core of the company’s operations. For 8 years, he has managed Allegro teams that develop the runtime platform for allegro.pl. Outside of work, he is a keen guitarist and a proud father of two sons"
    }
}
