{"pageProps":{"podcast":{"date":"2020-05-04T00:00:00.000Z","slug":"jak_testy_moga_wplynac_na_zycie","title":"Jak testy mogą wpłynąć na życie?","author":"pawel.zwierzchowski","name":"Paweł Zwierzchowski","toc":["Jaką wagę mają testy przy wytwarzaniu oprogramowania, pamiętając, że nie wszystkie testy są takie same?","Jak ułożyć proces testowy, który się sprawdza?","Czy tester powinien tylko testować i jak może zdjąć ogrom pracy ze swojego zespołu przy okazji żyjąc w zgodzie z developerami?","Czyli praca testera w scrumie i nie tylko. Na te i inne pytania odpowiada Paweł Zwierzchowski - Senior Software Test Engineer w Allegro."],"links":{"Allegro Tech Talks 32 Toruń - Wild, Wild Test... with microservices - Paweł Zwierzchowski":"https://www.facebook.com/allegro.tech/videos/536167340289191/"},"platforms":{"spotify":"https://open.spotify.com/episode/6uFNwITBKYKYRbNT22mr91","applepodcasts":"https://podcasts.apple.com/pl/podcast/9-jak-testy-mog%C4%85-wp%C5%82yn%C4%85%C4%87-na-%C5%BCycie-pawe%C5%82-zwierzchowski/id1500315781?i=1000473469220","googlepodcasts":"https://podcasts.google.com/?feed=aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS84ODc5MTQucnNz&episode=QnV6enNwcm91dC0yOTAzNjY1&ved=0CAcQ38oDahcKEwjo3fqi4ZnpAhUAAAAAHQAAAAAQAQ"},"id":9,"host":"piotr.betkier","authorData":{"name":"Paweł Zwierzchowski","bio":"Software test engineer with a relevant full stack experience from various companies, who helps achieve better quality results by testing software and sharing knowledge. Testing has been his life since 2011. A real team member, involved not only in all the testing, but also in the final delivery of the product to end users. Besides testing, he loves all kinds of cars and PC games. A big fan of donuts.","linkedin":"paweł-zwierzchowski","author":"pawel.zwierzchowski"},"hostData":{"name":"Piotr Betkier","bio":"Software Engineer who loves building useful tools and resilient systems. Works in one of the technical platform teams, where he's responsible for common libraries and service discovery (Service Mesh). Conference speaker, host of Allegro Tech Podcast.","twitter":"piotrbetkier","author":"piotr.betkier"}}},"__N_SSG":true}