{"pageProps":{"podcast":{"date":"2020-03-16T00:00:00.000Z","slug":"it_security_w_allegro","title":"IT security w Allegro","author":"wojciech.lesicki","name":"Wojciech Lesicki","desc":"\n","toc":["Na czym skupiamy się w IT security w Allegro?","Jak radzimy sobie z bezpieczeństwem w dynamicznym środowisku mikrousług przy setkach wdrożeń dziennie?","Jakie testy robimy ciągle manualnie?","Skąd czerpać informacje na temat bezpieczeństwa i czemu warto zainteresować się frameworkiem Att&ck MITRE?",null,"Na te i więcej pytań odpowiada Wojciech Lesicki – Team Leader w Allegro."],"links":{"Bezpieczeństwo przy tysiącach wdrożeń na konferencji CONFidence 2018 wraz z Pawłem Czubachowskim":"https://www.youtube.com/watch?v=7ONV-jLmlAw","CSP - Nasze doświadczenia z ochroną Allegro na konferencji Pozitivetech 2019 wraz z Pawłem Czubachowskim":"https://www.youtube.com/watch?v=T6HHipJRBUk","Polowanie na czerwony październik - na konferencji BSides Warsaw 2019, Dawid Golak, Jarosław Pukacki":"https://www.youtube.com/watch?v=LGMCQx-jZBw","Opis framework Att&ck MITRE":"https://attack.mitre.org/resources/getting-started/","Allegro Bug Bounty Program":"https://hackerone.com/allegro"},"platforms":{"spotify":"https://open.spotify.com/episode/4raXlG4uafbpArQZGXut37","applepodcasts":"https://podcasts.apple.com/pl/podcast/4-it-security-w-allegro-wojciech-lesicki/id1500315781?i=1000468696801","googlepodcasts":"https://podcasts.google.com/?feed=aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS84ODc5MTQucnNz&episode=QnV6enNwcm91dC0yOTAzNTkw&ved=0CAIQkfYCahcKEwjA-OKj4J_oAhUAAAAAHQAAAAAQAQ"},"id":4,"authorData":{"name":"Wojciech Lesicki","bio":"Team Leader in the IT Security department. Once responsible for cloud solutions (OpenStack, AWS etc.) and containerization (Mesos / Marathon). Currently, he focuses on defending the entire Allegro platform, the security of the implementation process, pentests and projects related to the security of the entire company. He works with developers and business looking for what can be done to make it more secure. He loves all possibilities of improving products / solutions / technologies.  Recently, he also started promoting knowledge of IT security in native Poznań. In his free time he walks the mountains and explores the Att&ck MITER framework.","twitter":"WLesicki","linkedin":"wojciechlesicki","author":"wojciech.lesicki"}}},"__N_SSG":true}