{
    "piotr.orlowski": {
        "name": "Piotr Orłowski",
        "bio": "Software Development Manager with over twenty years of experience in IT and e-commerce. At Allegro he manages the work of 150+ engineers taking care of their continuous substantive development, he is responsible for the technical quality, stability and efficiency of the Allegro platform. He likes simple solutions which gives more possibilities than originally planned :)",
        "twitter": "nigraspl"
    },
    "adam.dubiel": {
        "name": "Adam Dubiel",
        "bio": "Adam is the library guy, who loves designing reusable software components with minimal dependencies, maximal usefulness and user friendly API. At Allegro he leads team responsible for creating internal services-for-services and tools that make development of microservices easier, the most significant one being [Hermes](http://hermes.allegro.tech/).",
        "twitter": "dubieladam",
        "github": "adamdubiel"
    },
    "piotr.stapp": {
        "name": "Piotr Stapp",
        "bio": "Doer. Microsoft MVP. Master of Science. Speaker and blogger. VP at devwarsztaty.pl. CxO of dotnetomaniak.pl. Don't Stapp me now, please!",
        "twitter": "ptrstpp950",
        "linkedin": "piotrstapp"
    },
    "pawel.zwierzchowski": {
        "name": "Paweł Zwierzchowski",
        "bio": "Software test engineer with a relevant full stack experience from various companies, who helps achieve better quality results by testing software and sharing knowledge. Testing has been his life since 2011. A real team member, involved not only in all the testing, but also in the final delivery of the product to end users. Besides testing, he loves all kinds of cars and PC games. A big fan of donuts.",
        "linkedin": "paweł-zwierzchowski"
    },
    "martyna.niszczota": {
        "name": "Martyna Niszczota",
        "bio": "Martyna works in Delivery Promise product. Her priorities are effective, client-oriented results; and maintaining positive relations within the developers team and promoting cooperation with other departments. Martyna has got an HR background and her view of the IT world is different from the standard one.",
        "linkedin": "martyna-niszczota"
    },
    "kasia.wrobel": {
        "name": "Kasia Wróbel",
        "bio": "UX designer who let her curiosity be the driving force of her life. Introverted, but willing to discuss dogs. A lifelong bookworm with a black sense of humour included.",
        "linkedin": "katarzyna-wrobel-ux"
    },
    "ireneusz.gawlik": {
        "name": "Ireneusz Gawlik",
        "bio": "Fascinated with Machine Learning and applying it to create products at scale. When he wanted to develop and learn while working in the best commercial ML research group in the country, he created one. In his spare time he plays the drums, traveling with bandmates to unusual places."
    },
    "eryk.napierala": {
        "name": "Eryk Napierała",
        "bio": "Guardian of web performance at Allegro. Front-end developer who is not afraid of data analysis. Meet.js Poznań co-organizer.",
        "github": "erykpiast"
    },
    "tomasz.nurkiewicz": {
        "name": "Tomasz Nurkiewicz",
        "bio": "Java Champion. Author, trainer, conference speaker, technical reviewer, runner. Wrote a book on RxJava for O’Reilly. Claims that code not tested automatically is not a feature but just a rumour.",
        "twitter": "tnurkiewicz",
        "github": "nurkiewicz"
    },
    "wojciech.lesicki": {
        "name": "Wojciech Lesicki",
        "bio": "Team Leader in the IT Security department. Once responsible for cloud solutions (OpenStack, AWS etc.) and containerization (Mesos / Marathon). Currently, he focuses on defending the entire Allegro platform, the security of the implementation process, pentests and projects related to the security of the entire company. He works with developers and business looking for what can be done to make it more secure. He loves all possibilities of improving products / solutions / technologies.  Recently, he also started promoting knowledge of IT security in native Poznań. In his free time he walks the mountains and explores the Att&ck MITER framework.",
        "twitter": "WLesicki",
        "linkedin": "wojciechlesicki"
    },
    "justyna.osten-sacken": {
        "name": "Justyna Osten-Sacken",
        "bio": "UX researcher part of a team taking care of end-to-end customer experience - starting from search and selection till purchase. Having her team by her side, she creates knowledge and recommendations based on customers opinions. It helps teams to introduce new products or changes to existing ones. She practices calligraphy, likes Italian small towns and micro trips around Poland. Cooking relaxes her very much. Hitchhiking enthusiast.",
        "linkedin": "justyna-osten-sacken"
    },
    "adam.dudczak": {
        "name": "Adam Dudczak",
        "bio": "Team manager in allegro.pl, on a daily basis I work on improving search experience in the biggest ecommerce site in Poland. I am professionally involved with Java and related technologies since 2004, currently focused on search and information retrieval. Organizer of GeeCON conference and former leader of Poznan Java User Group.",
        "twitter": "maneo"
    },
    "kamil.borzym": {
        "name": "Kamil Borzym",
        "bio": "Kamil is an iOS software developer. He is very curious of how things work internally, so he likes to decompile frameworks and apps.",
        "twitter": "kam800"
    },
    "piotr.betkier": {
        "name": "Piotr Betkier",
        "bio": "Piotr loves building reliable systems and useful tools. He’s been developing the Allegro technical platform for many years, providing core solutions for the microservices architecture. After work he’s passionate about mountains and jazz.",
        "twitter": "piotrbetkier",
        "linkedin": "piotrbetkier"
    },
    "lukasz.sciga": {
        "name": "Łukasz Ściga",
        "bio": "Data Engineer w Allegro, którego pasją jest programowanie gier komputerowych.",
        "linkedin": "łukasz-ściga-274150138"
    },
    "dariusz.jedrzejczyk": {
        "name": "Dariusz Jędrzejczyk",
        "bio": "Principal Software Engineer at Allegro Technical Platform and former Leader of the team responsible for introducing Service Mesh.",
        "twitter": "chemicL",
        "linkedin": "dariuszjedrzejczyk"
    },
    "michal.janiszewski": {
        "name": "Michał Janiszewski",
        "bio": "Over 10 years in the IT industry in various roles. Addicted to building both great products and engineering teams at scale. Currently at Allegro, he is responsible, among others, for the Developers Experience of the Technical Platform products used daily by all engineers in the company. Privately, he builds drones, rides a motorcycle, with which he likes to tinker sometimes, and also takes amateur photos and films from his travels.",
        "twitter": "mjaniszew",
        "linkedin": "◌michał-janiszewski-345a0765"
    },
    "piotr.klapczynski": {
        "name": "Piotr Klapczyński",
        "bio": "Piotr has been a Site Reliability Engineer for seven years. Currently, he supports stability as a SRE team leader responsible for the development of chaos engineering tools and performance tests.",
        "twitter": "klaper_",
        "linkedin": "piotr-klapczyński-6540a63"
    },
    "alicja.halamska": {
        "name": "Alicja Halamska",
        "bio": "Ukończyła Politechnikę Poznańską z tytułem inżyniera, jest miłośniczką trudnych problemów, których rozwiązanie sprawia jej najwięcej satysfakcji. Uwielbia poznawać nowe technologie i analizować ich różnice oraz podobieństwa. Do wszystkiego podchodzi z dystansem, a prywatnie uwielbia chodzić po górach.",
        "linkedin": "alicja-halamska-965875166"
    },
    "jakub.kaczmarski": {
        "name": "Jakub Kaczmarski",
        "bio": "Technology Director at Allegro.pl, responsible for the product and technology areas at Allegro Smart! and Delivery Experience in Allegro, including the ERP system (Microsoft DAX) of the Official Allegro Store. In Allegro.pl since 2013 - he manages a team of approximately 200 engineers, product managers and analysts. Former Java developer and certified Oracle database administrator. Previously, the Head of the Software Development Department at Gazeta.pl (Agora). Privately basketball fan.",
        "linkedin": "jakub-kaczmarski"
    },
    "aleksandra.wasielewska": {
        "name": "Aleksandra Wasielewska",
        "bio": "Product Manager with over 10 years of experience in ebanking, online payments and ecommerce areas. Ola is passionate about technology and people. In Allegro she takes care of consumer-centric solutions in payments area where she improves and provides new financial services and addresses needs of million of Allegro customers. Every day she is surrounded by stakeholders and tech teams where she is in her element. Specifically attuned to the challenges of women in tech and the voice of those who change theirs carrier direction. An agile enthusiast in every way, enjoys spending time traveling around the world, reflecting cultural contrasts in the day-by-day life, as well as in the products.",
        "linkedin": "aleksandra-wasielewska-0036b852"
    },
    "julia.bluszcz": {
        "name": "Julia Bluszcz",
        "bio": "Julia holds degrees in statistics and quantitative methods in economics from the Humboldt University in Berlin and Warsaw School of Economics. She has gathered work experience in tech start-ups Nethone and Omni:us where she worked on fraud detection in credit card transactions and organized tech-related events, e.g. Machine Intelligence Summit in Berlin. Her scientific interests include machine learning, data visualization, and econometrics. Julia works as a Senior Data Scientist at Allegro, where she specializes in forecasting and analysing consumer buying behavior.",
        "linkedin": "julia-bluszcz-432103136"
    },
    "michal.bareja": {
        "name": "Michał Bareja",
        "bio": "Michał is a Development Team Leader in the Delivery Experience area. Huge fan of Domain-Driven Design, Test-Driven Development, Pair Programming, Event Storming and Agile methodologies. Worked in software houses through most of his career. After joining Allegro, he discovered that product development means a lot more than just writing code.",
        "linkedin": "michaelbareja",
        "twitter": "MichaelBareja"
    },
    "bartosz.galek": {
        "name": "Bartosz Gałek",
        "bio": "Just as Obelix did not need a magic drink to be strong - Bartosz does not need coffee to always be full of energy and shares it with his team. Huge fan of board games, supporter and co-creator of open source software. Operates in Warsaw! Bartosz cannot resist Hackathon attendance.",
        "github": "bgalek"
    },
    "dariusz.eliasz": {
        "name": "Dariusz Eliasz",
        "bio": "His main interests include Big Data solutions architecture and data governance. He is enthusiastic about scalable distributed solutions, processing large datasets and constant search for improvements. He combines all those interests with planning and managing projects that implement said solutions."
    },
    "piotr.michonski": {
      "name": "Piotr Michoński",
      "bio": "Piotr’s main interests include creating a technological platform and combining human and technological development  –  the one that drives Allegro’s growth and lies at the core of the company’s operations. For 8 years, he has managed Allegro teams that develop the runtime platform for allegro.pl. Outside of work, he is a keen guitarist and a proud father of two sons"
    },
    "ewa.ludwiczak": {
      "name": "Ewa Ludwiczak",
      "bio": "Tester for a long time, team leader since recently. With her team Kuoka, she is contributing to the development of Allegro mobile application. She co-organizes Allegro Mobile Hackathon and DevDay. She enjoys coding with children, portrait photography and boogie dancing.",
      "linkedin": "ewa-ludwiczak-25268b54",
      "twitter": "EwaLudwiczak"
    },
    "jakub.dowgird": {
      "name": "Jakub Dowgird",
      "bio": "Manager of the best informed team at Allegro (supposedly). Wanted to be a journalist, moved towards communication. Believe it or not - it is a more creative option. A communication expert with more than 15 years of experience. In his spare time - a geek, traveler, podcast producer, actor and director in an amateur theater. Occasionally races his Mazda MX-5."
    },
    "barbara.kaczorek": {
      "name": "Barbara Kaczorek",
      "bio": "Skilled and experienced Product Manager with 6 years experience in ecommerce and logistic areas. Take-charge attitude. An analytical thinker who works collaboratively to get the job done. Cooking and baking relaxes her very much. Basia enjoys spending time traveling. Bookworm with a sarcastic sense of humour included.",
      "linkedin": "barbarakaczorek"
    },
    "jakub.kwietko": {
      "name": "Jakub Kwietko",
      "bio": "The leader of development teams in the OpenNet company, which has been in the Allegro group since 2021. For almost a decade, he has been creating and developing mobile applications for courier companies. After the merger with Allegro, he uses his passion and engineering education in the field of electronics and IT in the Allegro One Box green parcel lockers project. He was appreciated for his commitment to this topic and received the Allegro Heroes award. He spends his free time actively - on mountain trails and night bike tours.",
      "linkedin": "jakubkwietko"
    },
    "pawel.marcinkowski": {
      "name": "Paweł Marcinkowski",
      "bio": "Data & AI Leader at Allegro Pay, biggest deferred payment method in Central Europe. Together with a team of dedicated professionals: data product managers, engineers, data scientists and analysts he is responsible for building the best customer finance experience in online e-commerce.\n\nPaweł is responsible for data products like analytical data warehouse, data mesh pipelines, MLops architecture, BI platform, decision engine and machine learning models for Allegro Pay.\n\nHe has a strong data science background with a few years managing engineering teams. For 7 years gained versatile experience in consulting. Since then developing finance products from Data & AI perspective.\n\nPaweł believes that the best effects are achieved by creating an environment where people can safely leave their comfort zone to efficiently deliver complex solutions .\n\nEngaged in employer branding activities to bring best talents to organizations by creating talent programs, taking part in technical podcasts, presenting on multiple data science conferences.",
      "linkedin": "pawelmarcinkowski"
    },
    "jakub.westfalewski": {
      "name": "Jakub Westfalewski",
      "bio": "For over 10 years he has been working at the Allegro office in Toruń. Currently, the manager of teams dealing with the procurement process and post-purchase. Privately, a lover of music, taking photos and a gadget fan.",
      "linkedin": "jakub-westfalewski-670b2b52"
    },
    "pawel.wolak": {
      "name": "Paweł Wolak",
      "bio": "Front-end developer who’s responsible for notifications in Allegro (sometimes also from the back-end side). Interested in topics related to web performance, usability and accessibility.",
      "linkedin": "pwolaq"
    },
    "riccardo.belluzzo": {
        "name": "Riccardo Belluzzo",
        "bio": "Riccardo is a Research Engineer in the Allegro ML team and specializes in Natural Language Processing and Understanding. Riccardo is also a music freak, playing guitar in his free time and running a podcast about underground music and emerging artists.",
        "linkedin": "riccardo-belluzzo"
    },
    "bartosz.wojtkiewicz": {
        "name": "Bartosz Wojtkiewicz",
        "bio": "Bartek is a Principal Software Engineer at Allegro who is working on making Allegro Platform ready for international customers. He tries to make a living as a T-Shaped engineer with a solid background in backend engineering. Enjoys pandemic lockdowns and obscure japanese games on Nintendo Switch.",
        "linkedin": "bartosz-wojtkiewicz-11585658"
    },
    "artur.chabera": {
        "name": "Artur Chabera",
        "bio": "Artur has been with Allegro for 2 years. His main focus is the area of payments and the iOS purchase process. He likes to look at the application through the prism of accessibility. He likes to spend his free time riding a bike and reading sci-fi novels.",
        "twitter": "arturchabera"
    },
    "patrycja.haraburda": {
        "name": "Patrycja Haraburda",
        "bio": "A graduate of Computer Science and Biomedical Engineering at Warsaw University of Technology. On a daily basis, she develops Allegro applications for Android and iOS platforms. Her achievements include a scientific publication on the recognition of eye diseases using neural networks.",
        "linkedin": "patrycjaharaburda"
    },
    "michal.wisniewski": {
        "name": "Michał Wiśniewski",
        "bio": "Junior Software Engineer at Allegro Ads and Computer Science student at University of Warsaw. Responsible for DSP - advertising outside Allegro in the RTB model. He enjoys solving challenging problems - both business and technical. Privately, a lover of books, games and movies set in fantasy worlds like the Lord of the Rings or the Witcher.",
        "linkedin": "michał-wiśniewski-0b63241b6",
        "github": "questras"
    },
    "adrianna.dworniak": {
        "name": "Adrianna Dworniak",
        "bio": "Product Manager at Allegro for 2 years. Although her tenure in the company is relatively short, the list of her Allegro achievements includes initiatives such as Allegro Family, coupons or onboarding for new users. Currently, she is exploring the secrets of the Allegro mobile application, so that its value could soon surprise you. In product management, she is most interested in finding a way to quickly and effectively test business hypotheses with the support of technology. She learns and wants to develop in growth, which she explores systematically and with undisguised passion.",
        "linkedin": "adrianna-dworniak-5a6693199"
    },
    "lukasz.gomolka": {
        "name": "Łukasz Gomółka",
        "bio": "13 years at Allegro. From the beginning with product: he started his career as a business analyst, continuing it as product owner and product manager, until recently taking over the role of product team leader. His product portfolio covers mainly the areas of payments (Allegro Pay, consumer / commercial finance, installment products) and topics related to increasing consumer involvement (Allegro Family, coupons), he also co-leads large international projects at Allegro. As a leader, he likes to develop the strengths of product managers.",
        "linkedin": "lukaszgomolka"
    },
    "zosia.smierzchalska": {
        "name": "Zosia Śmierzchalska",
        "bio": "UX Designer for 7 years at Allegro. She started her adventure with design while studying Communication Design specialization. Apart from Allegro, she cooperated with companies such as Orange and InPost. Currently, as a team leader, she cares about user involvement by developing, among others, the Allegro Smart service and mobile applications. In her work, she loves to have constant contact with people and values interdisciplinary cooperation. The more complicated the process to redesign, the more fascinated she becomes by her work. A fan of good food, especially Italian cuisine. Outside of work, she also deals with design, but she swaps services and products for interiors that are her passion."
    },
    "jakub.dodot": {
        "name": "Jakub Dodot",
        "bio": "UX Researcher associated with Allegro for the past 10 years. He started his professional career with design and over time changed his specialization towards UX research. In addition to Allegro, he provided research support to e.g. Ceneo, OLX, OtoMoto or Otodom. Among the whole range of methods, he feels best in usability tests and surveys. For the past 3 years, he has been changing his role from a specialist to a research team manager. In the new role he is looking for new ways to develop and optimize research work in the dynamically changing e-commerce industry. An economist and automation engineer by education, he decided to abandon accounting and robot programming in favor of learning about customer problems and optimizing websites and applications for them. Privately, a big fan of everything automotive, cycling and a supporter of a healthy lifestyle.",
        "linkedin": "jakub-dodot-5196348a"
    },
    "bartosz.kaczynski": {
        "name": "Bartosz Kaczyński",
        "bio": "Seasoned 1st line IT Support manager, experienced in managing remote / multinational teams. Strong interpersonal skills and keen wit help me lead (probably) the best IT Support team in Poland. Bachelors’ degree in psychology may have something to do with that. Tenure at Allegro: 12 years. Business-oriented, impact-driven, automation-seeking efficiency enthusiast. Also a petrolhead, a mountain biker, an amateur musician and a cat person.",
        "linkedin": "bartoszkaczynski"
    },
    "alina.magowska": {
        "name": "Alina Magowska",
        "bio": "For over a decade, it has been connecting People with Technology and Business. At Allegro, she is responsible for researching customer needs - their problems, behaviors and dreams, as well as responding to them in the design process. She is a cognitive psychologist, and her experience working in an organization was strengthened by her MBA degree. She supports and advises on the development of growing individuals and companies.",
        "linkedin": "alinamagowska"
    },
    "agnieszka.jagusiak": {
        "name": "Agnieszka Jagusiak",
        "bio": "At Allegro, she develops IT products and solutions - currently supporting quality and effective customer service and the Trust & Safety area. She is responsible for innovative technological transformation programs based on automation and ML. As a mentor and coach, she helps other leaders in the IT industry to develop.",
        "linkedin": "agnieszka-jagusiak"
    },
    "tomasz.szczerba": {
        "name": "Tomasz Szczerba",
        "bio": "Senior Manager at Allegro Pay. On a daily basis, he deals with improving Allegro Pay from the usability and technological side. He feels best with C# but I like learning new things, which made me write scala, f# and javascript, among others. Privately, I like to explore on a bike, read books about space and play Nintendo games.",
        "linkedin": "tomasz-szczerba"
    },
    "mariusz.budzyn": {
        "name": "Mariusz Budzyn",
        "bio": "Senior Manager at Allegro Pay. Leader of technical teams for the financial services Allegro Pay, Allegro Pay Business and Merchant Finance. He uses strong analytical skills to simplify the world of finance through technology, and as an F1 fan, he strives for faster and reliable solutions. He feels that petrol also flows in his veins, and spends his free time adapting smart home solutions in his home.",
        "linkedin": "mariuszbudzyn"
    }
}