{"pageProps":{"podcast":{"date":"2020-05-18T00:00:00.000Z","slug":"misja_zmiana_branzy_zakonczona_sukcesem","title":"Misja zmiana branży zakończona sukcesem! Jak wygląda dzień Product Managera","author":"martyna.niszczota","name":"Martyna Niszczota","toc":["Czy pracując w IT trzeba rozmawiać z ludźmi?","Budowanie relacji to mity i każdy skupia się na swoim kodzie?","Gdzie w całej tej układance jest Klient, czy jest tylko odbiorcą naszych rozwiązań?","Martyna odpowie na te pytania i przybliży nam jak wygląda jej dzień w roli Product Managera. Posiada ona background HRowy, dlatego jej spojrzenie na świat IT może różnić się od tego standardowego."],"links":{"Allegro Tech Talks - Misja zmiana branży - Martyna Niszczota":"https://www.facebook.com/allegro.tech/videos/422730938455309"},"platforms":{"spotify":"https://open.spotify.com/episode/2qew8aegQoDOf9NimcAI9N","applepodcasts":"https://podcasts.apple.com/pl/podcast/10-misja-zmiana-bran%C5%BCy-zako%C5%84czona-sukcesem-jak-wygl%C4%85d%C4%85/id1500315781?i=1000474989027","googlepodcasts":"https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS84ODc5MTQucnNz/episode/QnV6enNwcm91dC0yNzk5NTc0?ved=0CAcQ38oDahcKEwjAn7Da4bzpAhUAAAAAHQAAAAAQAQ"},"id":10,"host":"piotr.betkier","authorData":{"name":"Martyna Niszczota","bio":"Martyna works in Delivery Promise product. Her priorities are effective, client-oriented results; and maintaining positive relations within the developers team and promoting cooperation with other departments. Martyna has got an HR background and her view of the IT world is different from the standard one.","linkedin":"martyna-niszczota","author":"martyna.niszczota"},"hostData":{"name":"Piotr Betkier","bio":"Piotr loves building reliable systems and useful tools. He’s been developing the Allegro technical platform for many years, providing core solutions for the microservices architecture. After work he’s passionate about mountains and jazz.","twitter":"piotrbetkier","linkedin":"piotrbetkier","author":"piotr.betkier"}}},"__N_SSG":true}