{"pageProps":{"podcast":{"date":"2020-03-30T00:00:00.000Z","slug":"wyszukiwanie_w_allegro","title":"Wyszukiwanie w allegro - jak nie potknąć się o długi ogon?","author":"adam.dudczak","name":"Adam Dudczak","toc":["Dlaczego wyszukiwanie jest takie trudne?","Jak często Polacy szukają czegoś na Allegro?","Z jakimi danymi pracujemy tworząc wyszukiwarkę Allegro?","Jakich technologii używamy by odpowiadać na zapytania użytkownika w ciągu kilku milisekund?","Do czego używamy uczenia maszynowego i jak budujemy modele, które odpowiadają za sortowanie ofert w wynikach wyszukiwania?","Na te i inne pytania odpowiada Adam Dudczak - Team Manager w zespole wyszukiwarki Allegro."],"links":{"Apache Solr":"https://lucene.apache.org/solr/","Jak dostosowujemy i używamy Solr-a, opowiada Andrzej Wisłowski - nagranie z konferencji Activate":"https://www.youtube.com/watch?v=-pWeEvFNhV8","Plugin do exportowania dokumentów z Solra - utrzymywany przez Rafała Zarajczyka":"https://github.com/allegro/solr-ids-export-plugin","Plugin do Elasticsearch wpinający Morfologika w potok analizy w ES - zainicjowane przez Pawła Bobruka":"https://github.com/allegro/elasticsearch-analysis-morfologik","Plugin pozwalajacy łatwo odpalać ES na potrzeby testów integracyjnych - zainicjowane również przez Pawła Bobruka":"https://github.com/allegro/embedded-elasticsearch","Biblioteka do tworzenia modeli Learning-to-rank, stworzona w Allegro w zespole Machine Learning Research":"https://github.com/allegro/allRank","Spotkania Poznańskiej grupy użytkowników języka Java":"https://www.meetup.com/pl-PL/Poznan-Java-User-Group/","Konferencja GeeCON":"https://2020.geecon.org/"},"platforms":{"spotify":"https://open.spotify.com/episode/5oPZZTkam59QHLTENmS4s5","applepodcasts":"https://podcasts.apple.com/pl/podcast/6-wyszukiwanie-w-allegro-jak-nie-potkn%C4%85%C4%87-si%C4%99-o-d%C5%82ugi/id1500315781?i=1000469902782","googlepodcasts":"https://podcasts.google.com/?feed=aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS84ODc5MTQucnNz&episode=QnV6enNwcm91dC0yOTAzNjUz&ved=0CAcQ38oDahcKEwjgkoeDwsHoAhUAAAAAHQAAAAAQAQ"},"id":6,"host":"piotr.betkier","authorData":{"name":"Adam Dudczak","bio":"Team manager in allegro.pl, on a daily basis I work on improving search experience in the biggest ecommerce site in Poland. I am professionally involved with Java and related technologies since 2004, currently focused on search and information retrieval. Organizer of GeeCON conference and former leader of Poznan Java User Group.","twitter":"maneo","author":"adam.dudczak"},"hostData":{"name":"Piotr Betkier","bio":"Piotr loves building reliable systems and useful tools. He’s been developing the Allegro technical platform for many years, providing core solutions for the microservices architecture. After work he’s passionate about mountains and jazz.","twitter":"piotrbetkier","linkedin":"piotrbetkier","author":"piotr.betkier"}}},"__N_SSG":true}